app/controllers/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.all.page(params[:page]).per(9)

INSERT INTO "items" ("title", "price", "category", "description", "status", "image", "email", "phone_number", "location", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    user_id = current_user.id
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "title" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Fantastic Beasts"], ["updated_at", 2017-04-06 18:12:49 UTC], ["id", 9]]
---
  def update
    respond_to do |format|
      authorize @item
      if @item.update(item_params)